# To change this template, choose Tools | Templates
# and open the template in the editor.

UoamPasswordTootlTip=Heslo, kter\u00E9 chce\u0161 pou\u017E\u00EDt pro p\u0159ipojen\u00ED k UOAM serveru.
UoamNameTootlTip=Jm\u00E9no, kter\u00E9 maj\u00ED vid\u011Bt ostatn\u00ED u\u017Eivatel\u00E9 p\u0159ipojen\u00ED k UOAM.
UoamPortTootlTip=Port serveru na kter\u00E9m b\u011B\u017E\u00ED UOAM.
UoamServerTootlTip=Server na kter\u00FD se chce\u0161 aby se UOAM automaticky p\u0159ipojovala.
UoamTootlTip=AndariaPatcher umo\u017E\u0148uje automaticky p\u0159ipojit UOAM k serveru. Toho doc\u00EDli\u0161 t\u00EDm, \u017Ee v\u0161echny polo\u017Eky v sekci UOAM vypln\u00ED\u0161. Pot\u00E9, pokud se bude UOAM spou\u0161t\u011Bt po zav\u0159en\u00ED AndariaPatcheru, automaticky se p\u0159ipoj\u00ED...
UOPathTootlTip=Adres\u00E1\u0159, kde je nainstalovan\u00E1 ultima online. Patcher tam bude instalovat soubory pot\u0159ebn\u00E9 pro hran\u00ED na Andarii.
AutoRunToolTip=Program, kter\u00FD bude spu\u0161t\u011Bn po ukon\u010Den\u00ED AndariaPatcheru. Pokud nechce\u0161 spou\u0161t\u011Bt \u017E\u00E1dn\u00FD program, nech \u0159\u00E1dku pr\u00E1zdnou.
RemoveIntroToolTip=Sma\u017Ee \u00FAvodn\u00ED videa hry. T\u00EDm se zrychl\u00ED start a ud\u011Bl\u00E1 tro\u0161ku m\u00EDsta na disku.
RemoveDesktipNwbToolTip=Opravuje chybu spou\u0161t\u011Bn\u00ED ultimy online, p\u0159i kter\u00E9 hra spadne hned po spu\u0161t\u011Bn\u00ED.
DownloadTempToolTip=M\u00EDsto kam bude AndariaPatcher stahovat soubory z internetu. Je tak\u00E9 mo\u017En\u00E9 tam nahr\u00E1t ji\u017E sta\u017Een\u00E9 soubory, aby je AndariaPatcher nemusel stahovat.
DownloadTempSizeToolTip=Obsazen\u00E9 m\u00EDsto ve slo\u017Ece pro stahnut\u00E9 soubory
DownloadTempEraseToolTip=Sma\u017E v\u0161echny nepoz\u0159ebn\u00E9 soubory. To uvoln\u00ED m\u00EDsto. Neobj, pokud bude t\u0159eba tak si soubory p\u0159\u00ED\u0161t\u011B stahne znovat z Andarie.
DebugModeToolTip=Zobrazovat informace u\u017Eite\u010Dn\u00E9 pro lad\u011Bn\u00ED Andaria Patcheru a odstra\u0148ov\u00E1n\u00ED probl\u00E9m\u016F (debug re\u017Eim)
InstallUomlToolTip=Nainstaluje do slo\u017Eky uveden\u00E9 v\u00FD\u0161e novou ultimu.\n M\u016F\u017Ee b\u00FDt pou\u017Eito jak k oprav\u011B nefunk\u010Dn\u00ED uo, tak k instalaci nov\u00E9.\nTato \u010Dinost stahne cca 800MB ze serveru Andarie a rozbal\u00ED.\nProto si pros\u00EDm pohl\u00EDdej m\u00EDsto na disku.
SetAllInstalledToolTip=Nastav\u00ED v\u0161echy patche v seznamu patch\u016F jako nainstalovan\u00E9. Pou\u017Eij, pokud jsi spustil AndariaPatcher poprv\u00E9 a m\u00E1\u0161 ji\u017E Ultimu pln\u011B opatchovanou souborama za shardu Andarie.
RenewRegistryToolTip=Opravuje chybu spou\u0161t\u011Bn\u00ED ultimy online, p\u0159i kter\u00E9 hra spadne hned po spu\u0161t\u011Bn\u00ED.
ReadSettingsToolTip=Klikni pro na\u010Dten\u00ED nastaven\u00ED ze souboru s nastaven\u00EDm.
VersionToolTip=\u010C\u00EDslo verze AndariaPatcheru
SaveSettingsToolTip=Klikni pro ulo\u017Een\u00ED nastaven\u00ED do souboru s nastaven\u00EDm.
